{"questionlist":[



        
{"passage":"The goal is for the child to be physically active for a minimum of 60 minutes a day and restrict sedentary home activities to a maximum of two hours a day.",
"question":"How long should the child be active?",
"option1":"60 minutes",
"option2":"40 minutes",
"option3":"2 hours"
},

{"passage":"The nutmeg tree is native to tropical Indonesia, in a region known as the Spice Islands, and parts of Southeast Asia, where it has been used to produce spices for centuries.",
"question":"You can find nutmeg trees in ____",
"option1":"Indonesia",
"option2":"Thailand",
"option3":"Japan"
},

{"passage":"Technically, the word ‘pickle’ can refer to any pickled food, but in North America, most people think of cucumber pickles when pickles are under discussion.",
"question":"In North America, a pickle is usually made from a ______",
"option1":"cucumber",
"option2":"pepper",
"option3":"onion"
},

{"passage":"Although research into this concept had been performed since at least the 1800s, the terms 'emotional quotient' and 'emotional intelligence' did not become popular until the 1980s, when psychologists Peter Salovey of Yale and John Mayer of the University of New Hampshire began conducting research into it.",
"question":"This passage is mainly about ________",
"option1":"EQ",
"option2":"universities",
"option3":"psychologists"
},

{"passage":"As of 2011, there were 70 million households in the US that included at least a father and children, and 1.7 million of those fathers were single.",
"question":"This passage mainly talks about _____",
"option1":"single fathers",
"option2":"children",
"option3":"families in the US"
},

{"passage":"Dates that have been proposed as marking the beginning of the postmodern movement include 1914 in Europe and 1962 or 1968 in the United States.",
"question":"This passage describes the beginnings of ________",
"option1":"the postmodern movement",
"option2":"the postal service",
"option3":"the movement of modern post"
},

{"passage":"Much as America experienced the British invasion of rock stars in the 1960s, K-pop is certainly making its own inroads into other cultures, and many of its stars are internationally known.",
"question":"_____ is compared to British rock in the 1960s",
"option1":"K-pop",
"option2":"Inroads",
"option3":"American music"
},

{"passage":"A great literary villain is not any one thing; some are moustache-twirlers or evil geniuses, some are darkly complex, tortured souls, while others are amoral crazies who act wholly on impulse.",
"question":"The sentence describes types of ________",
"option1":"villains",
"option2":"moustaches",
"option3":"crazy people"
},

{"passage":"Symphony orchestras are commonly found in good-sized cities, and a number of notable orchestras exist both in the United States and around the world, though not all of them bear the word 'symphony' in their names.",
"question":"_____ are found worldwide",
"option1":"Symphony orchestras",
"option2":"Good-sized cities",
"option3":"Bears"
},

{"passage":"An increasing number of 'farmbots' are being developed that are capable of finicky and complex tasks that have not been possible with the large-scale agricultural machinery of the past.",
"question":"______ are being developed", 
"option1":"Robots",
"option2":"Farms",
"option3":"Large machines"
},

{"passage":"Many companies exist to repair iPhones – some by post, some by visiting you in person – but you can do it yourself provided you have steady hands and a bit of patience.", 
"question":"You can repair your iPhone ____",
"option1":"by yourself",
"option2":"cheaply",
"option3":"by watching a video"
},

{"passage":"The rapid loss of top predators such as dingoes, leopards and lions is causing an environmental threat comparable to climate change, an international group of scientists has warned.",
"question":"The sentence talks about the problem of ______",
"option1":"loss of predators",
"option2":"climate change",
"option3":"a group of scientists"
},

{"passage":"According to market research published by comScore in November 2009, Google Search is the dominant search engine in the United States market, with a market share of 65.6%.",
"question":"Google has almost _____ market share.",
"option1":"two thirds",
"option2":"one third",
"option3":"one half"
},

{"passage":"A short walk from a secluded stretch of unspoilt white-sand beach, south of the fishing village of Baan Nam Khem, is the Green Buddha Resort.",
"question":"What is the destination of the short walk?",
"option1":"The Green Buddha Resort",
"option2":"A beach",
"option3":"Nam Khem"
},

{"passage":"Lots of people hate Michael Bay – or at least say they do on internet forums and comment threads. And yet fans flock to his big-budget spectaculars in droves.",
"question":"Michael Bay is ______",
"option1":"hated but popular",
"option2":"loved but unpopular",
"option3":"a troublemaker"
},

{"passage":"Pidgin is a very basic language that is used to communicate between cultures. It is never the first language of a speaker, and it usually involves a blend of words and concepts from at least two, and sometimes more, cultures.",
"question":"______ speak(s) Pidgin as a first language",
"option1":"Nobody",
"option2":"Few people",
"option2":"Many people"
},

{"passage":"Perhaps the simplest explanation of lexicography is that it is a scholarly discipline that involves compiling, writing, or editing dictionaries.",
"question":"Lexicographers _______",
"option1":"work with dictionaries",
"option2":"work at universities",
"option3":"are disciplined"
},

{"passage":"If ever there was magic in my kitchen cupboard it is in the jar of dried mushrooms: porcini or perhaps tiny chanterelles; the jar that sees light of day less often than it should. ",
"question":"The writer enjoys _____",
"option1":"mushrooms",
"option2":"magic",
"option3":"light"
},

{"passage":"Although Nigeria's economic advantages are not immediately obvious, it certainly has the potential to become the hub of Africa's economy at a time when the continent is enjoying a sustained period of strong expansion.",
"question":"________, Nigeria could have a strong economy.",
"option1":"Surprisingly",
"option2":"Unfortunately",
"option3":"Obviously"
},

{"passage":"A vampire bat does not actually make use of fangs and suck the blood from its victims in the manner of the vampires of legend. Instead, the bats use their razor-sharp teeth to slit the skin and then lap the blood as it flows from the victim.",
"question":"Vampire bats are somewhat ________",
"option1":"misunderstood",
"option2":"athletic",
"option3":"incredible"
}


]}